app/controllers/school_classes_controller.rb

    def create
      @school_class = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "spanish"], ["room_number", 2], ["created_at", "2018-01-17 14:15:59.662155"], ["updated_at", "2018-01-17 14:15:59.662155"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 6], ["updated_at", "2018-01-17 14:16:12.456269"], ["id", 1]]